emacs-custom-extensions/my-org-extensions.org
#+TITLE: My Org Mode Extensions
#+AUTHOR: Sven
#+PROPERTY: header-args:emacs-lisp :tangle my-org-extensions.el :results silent

* Introduction

This file contains custom org-mode extensions to enhance productivity with org-mode in Emacs.
The file is set up to automatically tangle to =my-org-extensions.el= when saved.

* Auto-Tangle Configuration

This section contains the code that enables automatic tangling whenever this file is saved.

#+begin_src emacs-lisp
;; Auto-tangle on save
(defun org-babel-auto-tangle ()
  "Automatically tangle org file when saved."
  (when (eq major-mode 'org-mode)
    (let ((org-confirm-babel-evaluate nil))
      (org-babel-tangle))))

(add-hook 'after-save-hook 'org-babel-auto-tangle)
#+end_src

* Jira Integration

Functions and key bindings for interacting with Jira from org-mode.

** Open Jira Ticket at Point

This function looks for Jira ticket references in the current org section and
opens them in a browser. I normally add a link to the ticket or a tag in the
form =FP_1234= to the heading, but I want to be able to open the ticket in Jira
from anywhere in the section.

Press ˜SPC m j˜ to invoke the function.

#+begin_src emacs-lisp
  ;; Function to open Jira ticket from org section
  (defun my/org-open-jira-ticket-at-point ()
    "Find Jira ticket reference in current org section and open it in browser.
       Looks for:
       - Tag in the format FP_1234
       - Link in the format https://commercetools.atlassian.net/browse/FP-1234"
    (interactive)
    (let* ((jira-base-url "https://commercetools.atlassian.net/browse/")
           (ticket-id nil))

      ;; First check for tags on the current heading
      (save-excursion
        (org-back-to-heading t)
        (let ((tags (org-get-tags)))
          (when tags
            (dolist (tag tags)
              (when (string-match "\\([A-Z]+\\)_\\([0-9]+\\)" tag)
                (setq ticket-id (concat (match-string 1 tag) "-" (match-string 2 tag))))))))

      ;; If no tag found, look for URL in heading text and content
      (when (not ticket-id)
        (save-excursion
          (org-back-to-heading t)
          (let ((end-of-subtree (save-excursion (org-end-of-subtree) (point)))
                (url-regexp "https://commercetools\\.atlassian\\.net/browse/\\([A-Z]+-[0-9]+\\)"))
            (when (re-search-forward url-regexp end-of-subtree t)
              (setq ticket-id (match-string 1))))))

      ;; If ticket-id found, open in browser
      (if ticket-id
          (progn
            (browse-url (concat jira-base-url ticket-id))
            (message "Opening Jira ticket %s" ticket-id))
        (message "No Jira ticket reference found in this section"))))

  ;; Bind the function to a key in org-mode
  (spacemacs/set-leader-keys-for-major-mode 'org-mode "j" 'my/org-open-jira-ticket-at-point)
#+end_src

* Slack Integration
:PROPERTIES:
:ID:       67C86450-E260-4570-97C8-B16317F9957E
:END:
[2025-04-02 Wed 10:54]

This lets me copy anything from org mode formatted for Slack to the clipboard. Press Ctrl Shift F (Linux/Windows) or ⌘ Shift F (Mac) to apply formats.

#+begin_src emacs-lisp
  (evil-leader/set-key "aoS" 'org-slack-export-to-clipboard-as-slack)
#+end_src
* Git Integration

Functions for automating Git operations from org-mode.

** Auto-commit with Day Name

This function automatically commits all changes in the current repository and pushes them,
using the current day name (e.g., "Monday") as the commit message.

I end the work day with committing and pushing the org files to a Git repository
(I sync using that way). While it is fast using magit directly, I can automate
it. Then I don't have to type the commit message every time.

#+begin_src emacs-lisp
(defun my/org-git-commit-day ()
  "Commit all changes and push with the current day name as commit message."
  (interactive)
  (let* ((day-names '("Sunday" "Monday" "Tuesday" "Wednesday" "Thursday" "Friday" "Saturday"))
         (current-day (nth (string-to-number (format-time-string "%w")) day-names))
         (default-directory (or (magit-toplevel) default-directory)))

    (if (not (magit-toplevel))
        (message "Not in a git repository")
      (progn
        (message "Committing changes with message: %s" current-day)
        (magit-stage-modified t) ;; Stage all modified files
        (magit-commit-create (list "-m" current-day))
        (when (magit-get-current-branch)
          (magit-push-current-to-pushremote nil))
        (message "Successfully committed and pushed with message: %s" current-day)))))

;; Bind the function to a key in org-mode
(spacemacs/set-leader-keys-for-major-mode 'org-mode "g c" 'my/org-git-commit-day)
#+end_src

** Checkout branch belonging to current todo
[2025-04-07 Mon 10:29]

I have a property named =BRANCH= associated to some of my TODOs in org mode.
This contains the branch name in which I'm working on this TODO. This function
checks out this branch.

#+begin_src emacs-lisp
  (defun my/org-checkout-todo-branch ()
    "Check out the git branch specified in the BRANCH property of the current org-mode TODO.
  Uses magit for the checkout operation in the ~/development/frontastic directory.
  If no BRANCH property is found at point, recursively checks parent headings."
    (interactive)
    (let ((branch (org-entry-get (point) "BRANCH" t))  ; t means inherit from parents
          (project-dir "~/development/frontastic"))
      (if branch
          (progn
            (message "Checking out branch: %s in %s" branch project-dir)
            (let ((default-directory project-dir))
              (magit-checkout branch)))
        (message "No BRANCH property found in this heading or its parents"))))

  (with-eval-after-load 'org
    (spacemacs/set-leader-keys-for-major-mode 'org-mode "b" 'my/org-checkout-todo-branch))
#+end_src

** Show flycheck list of errors for modified files
:PROPERTIES:
:ID:       8FEDF343-9324-4F2C-8CAF-7069EFC7606F
:END:

I want to quickly check if there are any problems with the files I modifed before committing them.

#+begin_src emacs-lisp
  (defun magit-insert-flycheck-errors ()
    "Insert flycheck errors for modified files in magit status buffer."
    (when-let ((modified-files (magit-modified-files)))
      (let ((all-errors '()))
        ;; Collect errors from modified files
        (dolist (file modified-files)
          (let* ((full-path (expand-file-name file (magit-toplevel)))
                 (buffer (find-buffer-visiting full-path)))
            (when (and buffer (buffer-live-p buffer))
              (with-current-buffer buffer
                (when (and (bound-and-true-p flycheck-mode)
                           flycheck-current-errors)
                  (dolist (error flycheck-current-errors)
                    (push (cons file error) all-errors)))))))

        ;; Insert section if we have errors
        (when all-errors
          (magit-insert-section (flycheck-errors)
            (magit-insert-heading "Flycheck errors in modified files:")
            (dolist (file-error all-errors)
              (let* ((file (car file-error))
                     (error (cdr file-error))
                     (line (flycheck-error-line error))
                     (col (flycheck-error-column error))
                     (level (flycheck-error-level error))
                     (msg (flycheck-error-message error))
                     (face (pcase level
                             ('error 'flycheck-error)
                             ('warning 'flycheck-warning)
                             (_ 'flycheck-info))))
                (magit-insert-section (flycheck-error error)
                  (insert (format "  %s:%d:%d "
                                  (propertize file 'face 'magit-filename)
                                  line (or col 1)))
                  (insert (propertize (format "%s" level) 'face face))
                  (insert (format ": %s\n" msg)))))
            (insert "\n"))))))

  (with-eval-after-load 'magit
    ;; Add the section to magit status
    (magit-add-section-hook 'magit-status-sections-hook
                            'magit-insert-flycheck-errors
                            'magit-insert-unpushed-to-upstream
                            t))
#+end_src

* Standup Message Generator

Functions and customizations for generating daily standup messages from org tasks.

** Customization Variables

*** Hidden tags

These tags should not be included in the message. This is likely outdated as I
don't include any tags in the message. Note that this is not to filter out items
which are tagged with these tags.

#+begin_src emacs-lisp
(defcustom my/standup-hidden-tags '("REFILE" "gxp" "frontastic")
  "List of tags to hide in standup messages."
  :type '(repeat string)
  :group 'org-standup)
#+end_src

*** Template for the message

#+begin_src emacs-lisp
(defcustom my/standup-template
  "Yesterday I completed:\n%s\nI also worked on:\n%s\nToday I will:\n%s"
  "Template for standup messages. First %s is for completed tasks, second for clocked tasks, third for planned tasks."
  :type 'string
  :group 'org-standup)

(defcustom my/standup-monday-template
  "Last week I completed:\n%s\nI also worked on:\n%s\nToday I will:\n%s"
  "Template for Monday standup messages. First %s is for completed tasks, second for clocked tasks, third for planned tasks."
  :type 'string
  :group 'org-standup)
#+end_src

