emacs-custom-extensions/my-org-extensions.el
;; Auto-tangle on save
(defun org-babel-auto-tangle ()
  "Automatically tangle org file when saved."
  (when (eq major-mode 'org-mode)
    (let ((org-confirm-babel-evaluate nil))
      (org-babel-tangle))))

(add-hook 'after-save-hook 'org-babel-auto-tangle)

;; Function to open Jira ticket from org section
(defun my/org-open-jira-ticket-at-point ()
  "Find Jira ticket reference in current org section and open it in browser.
     Looks for:
     - Tag in the format FP_1234
     - Link in the format https://commercetools.atlassian.net/browse/FP-1234"
  (interactive)
  (let* ((jira-base-url "https://commercetools.atlassian.net/browse/")
         (ticket-id nil))

    ;; First check for tags on the current heading
    (save-excursion
      (org-back-to-heading t)
      (let ((tags (org-get-tags)))
        (when tags
          (dolist (tag tags)
            (when (string-match "\\([A-Z]+\\)_\\([0-9]+\\)" tag)
              (setq ticket-id (concat (match-string 1 tag) "-" (match-string 2 tag))))))))

    ;; If no tag found, look for URL in heading text and content
    (when (not ticket-id)
      (save-excursion
        (org-back-to-heading t)
        (let ((end-of-subtree (save-excursion (org-end-of-subtree) (point)))
              (url-regexp "https://commercetools\\.atlassian\\.net/browse/\\([A-Z]+-[0-9]+\\)"))
          (when (re-search-forward url-regexp end-of-subtree t)
            (setq ticket-id (match-string 1))))))

    ;; If ticket-id found, open in browser
    (if ticket-id
        (progn
          (browse-url (concat jira-base-url ticket-id))
          (message "Opening Jira ticket %s" ticket-id))
      (message "No Jira ticket reference found in this section"))))

;; Bind the function to a key in org-mode
(spacemacs/set-leader-keys-for-major-mode 'org-mode "j" 'my/org-open-jira-ticket-at-point)

(evil-leader/set-key "aoS" 'org-slack-export-to-clipboard-as-slack)

(defun my/org-git-commit-day ()
  "Commit all changes and push with the current day name as commit message."
  (interactive)
  (let* ((day-names '("Sunday" "Monday" "Tuesday" "Wednesday" "Thursday" "Friday" "Saturday"))
         (current-day (nth (string-to-number (format-time-string "%w")) day-names))
         (default-directory (or (magit-toplevel) default-directory)))

    (if (not (magit-toplevel))
        (message "Not in a git repository")
      (progn
        (message "Committing changes with message: %s" current-day)
        (magit-stage-modified t) ;; Stage all modified files
        (magit-commit-create (list "-m" current-day))
        (when (magit-get-current-branch)
          (magit-push-current-to-pushremote nil))
        (message "Successfully committed and pushed with message: %s" current-day)))))

;; Bind the function to a key in org-mode
(spacemacs/set-leader-keys-for-major-mode 'org-mode "g c" 'my/org-git-commit-day)

(defun my/org-checkout-todo-branch ()
  "Check out the git branch specified in the BRANCH property of the current org-mode TODO.
Uses magit for the checkout operation in the ~/development/frontastic directory.
If no BRANCH property is found at point, recursively checks parent headings."
  (interactive)
  (let ((branch (org-entry-get (point) "BRANCH" t))  ; t means inherit from parents
        (project-dir "~/development/frontastic"))
    (if branch
        (progn
          (message "Checking out branch: %s in %s" branch project-dir)
          (let ((default-directory project-dir))
            (magit-checkout branch)))
      (message "No BRANCH property found in this heading or its parents"))))

(with-eval-after-load 'org
  (spacemacs/set-leader-keys-for-major-mode 'org-mode "b" 'my/org-checkout-todo-branch))

(defun magit-insert-flycheck-errors ()
  "Insert flycheck errors for modified files in magit status buffer."
  (when-let ((modified-files (magit-modified-files)))
    (let ((all-errors '()))
      ;; Collect errors from modified files
      (dolist (file modified-files)
        (let* ((full-path (expand-file-name file (magit-toplevel)))
               (buffer (find-buffer-visiting full-path)))
          (when (and buffer (buffer-live-p buffer))
            (with-current-buffer buffer
              (when (and (bound-and-true-p flycheck-mode)
                         flycheck-current-errors)
                (dolist (error flycheck-current-errors)
                  (push (cons file error) all-errors)))))))

      ;; Insert section if we have errors
      (when all-errors
        (magit-insert-section (flycheck-errors)
          (magit-insert-heading "Flycheck errors in modified files:")
          (dolist (file-error all-errors)
            (let* ((file (car file-error))
                   (error (cdr file-error))
                   (line (flycheck-error-line error))
                   (col (flycheck-error-column error))
                   (level (flycheck-error-level error))
                   (msg (flycheck-error-message error))
                   (face (pcase level
                           ('error 'flycheck-error)
                           ('warning 'flycheck-warning)
                           (_ 'flycheck-info))))
              (magit-insert-section (flycheck-error error)
                (insert (format "  %s:%d:%d "
                                (propertize file 'face 'magit-filename)
                                line (or col 1)))
                (insert (propertize (format "%s" level) 'face face))
                (insert (format ": %s\n" msg)))))
          (insert "\n"))))))

(with-eval-after-load 'magit
  ;; Add the section to magit status
  (magit-add-section-hook 'magit-status-sections-hook
                          'magit-insert-flycheck-errors
                          'magit-insert-unpushed-to-upstream
                          t))

(defcustom my/standup-hidden-tags '("REFILE" "gxp" "frontastic")
  "List of tags to hide in standup messages."
  :type '(repeat string)
  :group 'org-standup)

(defcustom my/standup-template
  "Yesterday I completed:\n%s\nI also worked on:\n%s\nToday I will:\n%s"
  "Template for standup messages. First %s is for completed tasks, second for clocked tasks, third for planned tasks."
  :type 'string
  :group 'org-standup)

(defcustom my/standup-monday-template
  "Last week I completed:\n%s\nI also worked on:\n%s\nToday I will:\n%s"
  "Template for Monday standup messages. First %s is for completed tasks, second for clocked tasks, third for planned tasks."
  :type 'string
  :group 'org-standup)
