emacs-custom-extensions/my-org-extensions.el

(defun my/generate-standup-message ()
  "Generate a Slack standup message based on today's scheduled tasks, yesterday's completed tasks, and clocked tasks."
  (interactive)
  (let* ((today (ts-now))
         (day-of-week (ts-dow today))
         (is-monday (= day-of-week 1))
         (template (if is-monday my/standup-monday-template my/standup-template))
         (prev-workday-range (my/get-previous-workweek-range today))
         (exclude-tags (my/task-filter-tags))
         ;; Get today's planned tasks
         (planned-tasks (org-ql-query
                          :select '(list (org-get-category)
                                         (org-get-heading t t t t)
                                         (org-get-tags)
                                         (org-element-property :priority (org-element-at-point))
                                         (org-entry-get nil "EFFORT")
                                         (my/get-parent-context)
                                         (my/get-scheduled-time (point)))
                          :from (org-agenda-files)
                          :where `(and (scheduled :on today)
                                       (not (tags ,@exclude-tags)))))
         ;; Sort planned tasks by scheduled time
         (sorted-planned-tasks
          (sort planned-tasks
                (lambda (a b)
                  (let ((time-a (nth 6 a))
                        (time-b (nth 6 b)))
                    (cond
                     ;; Both have times, compare timestamps
                     ((and (car time-a) (car time-b))
                      (time-less-p (cdr time-a) (cdr time-b)))
                     ;; Only a has time, a comes first
                     ((car time-a) t)
                     ;; Only b has time, b comes first
                     ((car time-b) nil)
                     ;; Neither has time, use priority
                     (t (let ((pri-a (nth 3 a))
                              (pri-b (nth 3 b)))
                          (if (and pri-a pri-b)
                              (string< pri-a pri-b)
                            (if pri-a t nil)))))))))
         ;; Get completed tasks from previous workday
         (completed-tasks (org-ql-query
                            :select '(list (org-get-category)
                                           (org-get-heading t t t t)
                                           (org-get-tags)
                                           (org-element-property :priority (org-element-at-point))
                                           (org-entry-get nil "EFFORT")
                                           (my/get-parent-context))
                            :from (org-agenda-files)
                            :where `(and (done)
                                         (closed :from ,(car prev-workday-range) :to ,(cdr prev-workday-range))
                                         (not (tags ,@exclude-tags)))
                            :order-by '(priority)))
         ;; Get clocked tasks from previous workday
         (clocked-tasks (org-ql-query
                          :select '(list (org-get-category)
                                         (org-get-heading t t t t)
                                         (org-get-tags)
                                         (org-element-property :priority (org-element-at-point))
                                         (org-entry-get nil "EFFORT")
                                         (my/get-parent-context))
                          :from (org-agenda-files)
                          :where `(and (clocked :from ,(car prev-workday-range) :to ,(cdr prev-workday-range))
                                       (not (tags ,@exclude-tags)))
                          :order-by '(priority)))
         (message-text
          (with-temp-buffer
            (insert (format
                     template
                     (if completed-tasks
                         (mapconcat #'my/format-task completed-tasks "")
                       (if is-monday
                           "\n• _No tasks completed last week_\n"
                         "\n• _No tasks completed yesterday_\n"))
                     (if clocked-tasks
                         (mapconcat #'my/format-task clocked-tasks "")
                       "\n• _No tasks clocked_\n")
                     (if sorted-planned-tasks
                         (mapconcat (lambda (task)
                                      (my/format-task (butlast task))) sorted-planned-tasks "")
                       "\n• _No tasks scheduled_\n")))
            (buffer-string))))
    (kill-new message-text)
    (message "Standup message copied to clipboard!")
    (with-current-buffer (get-buffer-create "*Standup Preview*")
      (erase-buffer)
      (insert message-text)
      (switch-to-buffer-other-window (current-buffer)))))

(defun my/insert-standup-message ()
  "Insert the standup message at point."
  (interactive)
  (let ((message-text (with-current-buffer "*Standup Preview*"
                        (buffer-string))))
    (insert message-text)))

(defun my/generate-standup-message-as-day (day-number)
  "Generate a standup message as if today were the specified day.
DAY-NUMBER is the day of week number (0=Sunday, 1=Monday, ..., 6=Saturday).
This is useful for testing the Monday behavior on other days."
  (interactive "nEnter day number (0=Sun, 1=Mon, ..., 6=Sat): ")
  (let* ((today (ts-now))
         (current-dow (ts-dow today))
         (day-diff (- day-number current-dow))
         (simulated-day (ts-adjust 'day day-diff today))
         (ts-now-orig (symbol-function 'ts-now)))
    ;; Temporarily override ts-now to return our simulated day
    (cl-letf (((symbol-function 'ts-now) (lambda () simulated-day)))
      (message "Generating standup message as if today were %s"
               (nth day-number '("Sunday" "Monday" "Tuesday" "Wednesday" "Thursday" "Friday" "Saturday")))
      (my/generate-standup-message))))

(defun my/org-count-todays-tasks ()
  "Count tasks completed and created today.
Returns a string with the statistics."
  (let* ((today (format-time-string "%Y-%m-%d"))
         (done-count 0)
         (created-count 0))

    ;; Search for all tasks marked DONE today
    (org-map-entries
     (lambda ()
       (let ((closed (org-entry-get (point) "CLOSED")))
         (when (and closed (string-match today closed))
           (setq done-count (1+ done-count)))))
     "TODO=\"DONE\"" 'agenda)

    ;; Search for all tasks created today
    (org-map-entries
     (lambda ()
       (save-excursion
         (let ((end (save-excursion (outline-next-heading) (point)))
               (timestamp-regex (concat "\\[" today)))
           (forward-line 1)  ;; Move past the heading
           (when (and (< (point) end)
                      (re-search-forward timestamp-regex end t))
             (setq created-count (1+ created-count))))))
     "TODO={.+}" 'agenda)  ;; Match all TODO states

    ;; Format and return the results
    (format "- Tasks completed today: %d
- New tasks created today: %d"
            done-count created-count)))

(defun my/add-to-refile (text)
  "Add TEXT to the refile.org file."
  (save-window-excursion
    (find-file (concat my-org-file-path "/refile.org"))
    (goto-char (point-max))
    (insert "\n")
    (insert text)
    (save-buffer)))
