emacs-custom-extensions/my-org-extensions.org
** Add executables to exec-path

This ensures Emacs can find essential executables by using whereis to locate them and
adding them to the exec-path. I need this on NixOS because everything else I tried
didn't work.

#+begin_src emacs-lisp
  (defun my/add-executable-to-exec-path (executable)
    "Find EXECUTABLE using whereis and add its directory to exec-path."
    (let* ((whereis-output (shell-command-to-string (concat "whereis " executable)))
           (exec-file-path (when (string-match (concat "/" "[^ ]+" "/" executable) whereis-output)
                            (match-string 0 whereis-output))))
      (when exec-file-path
        (let ((exec-dir (file-name-directory exec-file-path)))
          (add-to-list 'exec-path exec-dir)
          (message "Added %s to exec-path" exec-dir)))))

  (defun my/add-essential-executables-to-exec-path ()
    "Add essential executables (git, node, sh, ispell, aider) to exec-path."
    (interactive)
    (dolist (executable '("git" "node" "sh" "ispell" "aider"))
      (my/add-executable-to-exec-path executable)))

  ;; Run when Emacs starts
  (eval-after-load 'org
    '(my/add-essential-executables-to-exec-path))
#+end_src

** Fix lsp mode for PHP
[2025-06-02 Mon 14:53]

Even though I configured lsp for PHP, I always manually have to ~M-x lsp~ when
opening a PHP buffer. This snipped fixes it by enabling lsp mode after a buffer
became visible (it doesn't work to add it to the php-mode-hook, likely because
that is too early).

#+begin_src emacs-lisp
  (defun my-enable-lsp-for-visible-php-buffers (frame)
    "Enable LSP mode for visible PHP buffers that don't have it active."
    (dolist (window (window-list frame))
      (with-current-buffer (window-buffer window)
        (when (and (derived-mode-p 'php-mode)
                   (not (bound-and-true-p lsp-mode)))
          (lsp-deferred)))))

  (add-hook 'window-buffer-change-functions #'my-enable-lsp-for-visible-php-buffers)
#+end_src

* Org-Edna extensions
[2025-04-02 Wed 10:39]

This lets me evaluate a named org-babel block when a heading is set to DONE.

Add a trigger to a heading like this:
#+begin_example
:TRIGGER: self eval-babel!("office-hour-stats")
#+end_example

And have a named babel block in the content.

#+begin_src emacs-lisp
  (defun org-edna-action/eval-babel! (last-entry block-name)
    "Execute the named Babel source block specified by BLOCK-NAME.
  LAST-ENTRY is the marker for the current heading."
    (save-excursion
      (with-current-buffer (marker-buffer last-entry)
        (goto-char last-entry)
        (org-babel-goto-named-src-block block-name)
        (org-babel-execute-src-block))))
#+end_src

* Provide statement (needs to be at the end!)

The provide statement must match the symbol you use in require
It should be the last line of executable code in your file
The feature name (symbol) should match your filename: =my-org-extensions.el= provides ~'my-org-extensions~

** Why This System Exists

This prevents infinite loops and ensures modules are only loaded once. When you require a feature:

- If it's already loaded, Emacs does nothing
- If not loaded, Emacs finds and loads the file that provides it
- The provide statement marks it as successfully loaded

Without the provide statement, Emacs doesn't know that your file actually provides the requested feature, so require fails.

#+begin_src emacs-lisp
  (provide 'my-org-extensions)
#+end_src
