emacs-custom-extensions/my-org-extensions.el

(defun my/add-executable-to-exec-path (executable)
  "Find EXECUTABLE using whereis and add its directory to exec-path."
  (let* ((whereis-output (shell-command-to-string (concat "whereis " executable)))
         (exec-file-path (when (string-match (concat "/" "[^ ]+" "/" executable) whereis-output)
                          (match-string 0 whereis-output))))
    (when exec-file-path
      (let ((exec-dir (file-name-directory exec-file-path)))
        (add-to-list 'exec-path exec-dir)
        (message "Added %s to exec-path" exec-dir)))))

(defun my/add-essential-executables-to-exec-path ()
  "Add essential executables (git, node, sh, ispell, aider) to exec-path."
  (interactive)
  (dolist (executable '("git" "node" "sh" "ispell" "aider"))
    (my/add-executable-to-exec-path executable)))

;; Run when Emacs starts
(eval-after-load 'org
  '(my/add-essential-executables-to-exec-path))

(defun my-enable-lsp-for-visible-php-buffers (frame)
  "Enable LSP mode for visible PHP buffers that don't have it active."
  (dolist (window (window-list frame))
    (with-current-buffer (window-buffer window)
      (when (and (derived-mode-p 'php-mode)
                 (not (bound-and-true-p lsp-mode)))
        (lsp-deferred)))))

(add-hook 'window-buffer-change-functions #'my-enable-lsp-for-visible-php-buffers)

(defun org-edna-action/eval-babel! (last-entry block-name)
  "Execute the named Babel source block specified by BLOCK-NAME.
LAST-ENTRY is the marker for the current heading."
  (save-excursion
    (with-current-buffer (marker-buffer last-entry)
      (goto-char last-entry)
      (org-babel-goto-named-src-block block-name)
      (org-babel-execute-src-block))))

(provide 'my-org-extensions)
